app/controllers/depts_controller.rb

  def show
    @depts = Dept.find(params[:id])
---
SELECT  "depts".* FROM "depts" WHERE "depts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def edit
    @depts = Dept.find(params[:id])
---
SELECT  "depts".* FROM "depts" WHERE "depts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]