app/controllers/depts_controller.rb

  def index
    @depts = Dept.all.order("name ASC")
---
SELECT "depts".* FROM "depts" ORDER BY dname ASC

  def create
    @dept = Dept.new(dept_params)

    if @dept.save
---
INSERT INTO "depts" ("name", "loc", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Garbage"], ["loc", "Who knows"], ["created_at", "2018-09-05 14:51:17.912746"], ["updated_at", "2018-09-05 14:51:17.912746"]]

  def destroy
    @dept.destroy
---
DELETE FROM "depts" WHERE "depts"."id" = $1  [["id", 8]]

  def find_dept
    @dept = Dept.find(params[:id])
---
SELECT  "depts".* FROM "depts" WHERE "depts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]